Autodesk.Revit.DB.DatumPlane.AddLeader(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Adds a default Leader for the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
Remarks:
The leader can be added only to ends where the bubble is set to be shown and does not have a leader applied.
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
Returns:
The Leader of the datum plane. Null will return if the view is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
-or-
The bubble is not visible at the datumEnd of the datum plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This datum plane has no leaders.
-or-
The DatumPlane already has a leader applied.
Since:
2016

Autodesk.Revit.DB.DatumPlane.SetLeader(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Leader)
Sets the leader to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
Remarks:
The leader can be applied only to ends where the bubble is set to be shown.
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
pLeader:
The Leader for setting the datum plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the conditions is not valid: the input leader and view is not null;
The leader End, Elbow, Anchor should be in the view;
the End of leader should be in the datum plane curves; Elbow is between End and Anchor.
-or-
The datum plane cannot be visible in the view.
-or-
The bubble is not visible at the datumEnd of the datum plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane.GetLeader(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Gets a copy of the leader applied to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
Returns:
The Leader of the datum plane. Null will return if no leader applied.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This datum plane has no leaders.
Since:
2016

Autodesk.Revit.DB.DatumPlane.IsLeaderValid(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Leader)
Identifies if the leader valid or not for this DatumPlane. This method does not apply to Reference planes (which do not support leaders).
Remarks:
If the view or leader is null, it will throw ArgumentNullException;
A valid leader meets the following conditions:
The leader's End, Elbow and Anchor should lie in the View's planeThe End of the leader should be on the datum plane's curve(s)The Elbow of the leader should be between the End and Anchor
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
leader:
The Leader for setting the datum plane.
Returns:
True if the leader is valid for set leader, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This datum plane has no leaders.
-or-
The DatumPlane should not have a leader.
Since:
2016

Autodesk.Revit.DB.DatumPlane.PropagateToViews(Autodesk.Revit.DB.View,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Propagates the extents applied to this datum in the view to the specified parallel views.
view:
The view on which the DatumPlane shows.
parallelViews:
The ids of the specified parallel views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
-or-
One ElementId in parallelViews is not valid for extent propagation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DatumPlane.GetPropagationViews(Autodesk.Revit.DB.View)
Gets a list of candidate views which are parallel to the current view and to which the extents of the datum may be propagated.
view:
The view on which the DatumPlane shows.
Returns:
A set of ElementIds of the parallel views for extent propagation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DatumPlane.IsCurveValidInView(Autodesk.Revit.DB.DatumExtentType,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Curve)
Checks if the curve is valid to be as the extents for the datum plane in a view.
The curve must be bound and coincident with the original one of the datum plane.
extentMode:
The extent type.
view:
The view.
curve:
The curve.
Returns:
True if it is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane.SetCurveInView(Autodesk.Revit.DB.DatumExtentType,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Curve)
Sets the extents to match the curve.
extentMode:
The extent type.
view:
The view.
curve:
The curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
-or-
The curve is unbound or not coincident with the original one of the datum plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane.GetCurvesInView(Autodesk.Revit.DB.DatumExtentType,Autodesk.Revit.DB.View)
Gets a collection of curves representing the DatumPlane element in the given view.
Remarks:
Curves returned for Model extents can be different than curves returned for View-specific extents (2d extents) in the given view.
In some cases, such as an arc grid in a section view, there will be two identical curves but offset from one another.
extentMode:
The extent type.
view:
The view.
Returns:
The curves.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane.SetDatumExtentType(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View,Autodesk.Revit.DB.DatumExtentType)
Sets whether the curve representing the datum plane is displayed according to its 3d extents, or else according to a view specific setting.
Remarks:
In a particular view, the datum plane is represented by a curve and the two ends of the curve may have different DatumExtentTypes in that view.
If the value is changed from DatumExtentType::Model to DatumExtentType::ViewSpecific, then the view specific extents will be identical to the model
extent until modified.
datumEnd:
Specifies one end of the curve representing the datum plane in the view.
view:
The view in which to set the datum extent settings.
extentMode:
The DatumExtentType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane.GetDatumExtentTypeInView(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Identifies whether the curve representing the datum plane is displayed according to its actual 3d extents, or else according to a view specific setting.
Remarks:
In a particular view, the datum plane is represented by a curve and the two ends of the curve may have different DatumExtentTypes in that view.
datumEnd:
Specifies one end of the curve representing the datum plane in the view.
view:
The view in which to evaluate the datum extent settings.
Returns:
The extent type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane.CanBeVisibleInView(Autodesk.Revit.DB.View)
Checks if the datum plane can be visible in the view.
Remarks:
This method determines if the orientation of the DatumPlane and View allows that the DatumPlane can be seen in the indicated view.
It does not actually determine if the DatumPlane is visible, as many factors can affect the visibility of an element in a given view (for example, hiding the element).
view:
The view.
Returns:
True if visible, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DatumPlane.HasBubbleInView(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Identifies if the DatumPlane has bubble or not.
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
Returns:
True if the DatumPlane has bubble, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This datum plane doesn't support bubble operations.
Since:
2016

Autodesk.Revit.DB.DatumPlane.IsBubbleVisibleInView(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Identifies if the bubble is visible or not in a view.
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
Returns:
True if the bubble is visible, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This datum plane doesn't support bubble operations.
Since:
2016

Autodesk.Revit.DB.DatumPlane.HideBubbleInView(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Hides the bubble in a view. This method does not apply to Reference planes.
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This datum plane doesn't support bubble operations.
Since:
2016

Autodesk.Revit.DB.DatumPlane.ShowBubbleInView(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Shows the bubble in a view. This method does not apply to Reference planes.
datumEnd:
The end of the datum plane.
view:
The view on which the DatumPlane shows.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This datum plane doesn't support bubble operations.
-or-
This DatumPlane doesn't have bubbles shown the view.
Since:
2016